In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df = pd.read_csv("D:\\excel data\\Social_Network_Ads.csv")

In [3]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [44]:
# df = df.iloc[:,2:]
df=df.iloc[:,2:]

In [45]:
df.sample(3)

Empty DataFrame
Columns: []
Index: [398, 227, 176]

In [41]:
df.head(2)

   Purchased
0          0
1          0

In [34]:
from sklearn.model_selection import train_test_split

In [35]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('Purchased', axis=1),df['Purchased'],test_size=0.3,random_state=0)

In [37]:
x_train.shape, x_test.shape

((280, 4), (120, 4))

In [38]:
x_train

      User ID  Gender  Age  EstimatedSalary
92   15809823    Male   26            15000
223  15593715    Male   60           102000
234  15619407  Female   38           112000
232  15813113    Male   40           107000
377  15800215  Female   42            53000
..        ...     ...  ...              ...
323  15619465  Female   48            30000
192  15779581    Male   29            43000
117  15591433    Male   36            52000
47   15776348  Female   27            54000
172  15794661  Female   26           118000

[280 rows x 4 columns]

In [39]:
x_test.shape

(120, 4)